{"convertedBy": "TensorFlow.js Converter v1.7.2", "generatedBy": "1.15.0", "modelTopology": {"versions": {"producer": 134}, "node": [{"op": "Placeholder", "name": "myInput", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}, {"size": "8"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"op": "Const", "name": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "Const_1", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "Const_5", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "transpose/perm", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "concat_10", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "5"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "concat_11", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "concat_12", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "LSTM_9539a08e/strided_slice", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/time", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayUnstack/range", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "15"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "mul_7", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "LSTM_24ab71e5/ReverseV2/axis", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "transpose_22", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}, {"size": "6"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "mul_9", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "6"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "ExpandDims_30/dim", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "transpose_18/perm", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "4"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "Const_158", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}]}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "Squeeze_13", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "GatherV2_5", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "Cast_1", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "1"}]}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "SparseToDense_1/default_value", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "Const_162", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT64"}}}}, {"op": "Const", "name": "concat_38", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "64"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "concat_39", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "128"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "concat_40", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}, {"size": "256"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "Const_163", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "Const_164", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "transpose_20", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "3"}, {"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "mul_5", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "32"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "transpose_21", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "992"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "Reshape_2/shape", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "2"}]}, "dtype": "DT_INT32"}}}}, {"op": "Slice", "name": "Slice", "input": ["myInput", "Const", "Const_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Enter", "name": "split/Enter", "input": ["concat_10"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_8/Enter", "input": ["concat_10"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_1/Enter", "input": ["concat_11"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_9/Enter", "input": ["concat_11"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_4/Enter", "input": ["concat_12"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_12/Enter", "input": ["concat_12"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_3", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_4", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_3", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_4", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_3", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_4", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_3", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_4", "input": ["LSTM_9539a08e/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "TensorArrayV3", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy9keW5hbWljX3Jubi9vdXRwdXRfMA=="}}}, {"op": "TensorArrayV3", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "5"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy9keW5hbWljX3Jubi9pbnB1dF8w"}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less_1/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "TensorArrayV3", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy9keW5hbWljX3Jubi9vdXRwdXRfMA=="}}}, {"op": "TensorArrayV3", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "5"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy9keW5hbWljX3Jubi9pbnB1dF8w"}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less_1/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "TensorArrayV3", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy9keW5hbWljX3Jubi9vdXRwdXRfMA=="}}}, {"op": "TensorArrayV3", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "64"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy9keW5hbWljX3Jubi9pbnB1dF8w"}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less_1/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "TensorArrayV3", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/TensorArray", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy9keW5hbWljX3Jubi9vdXRwdXRfMA=="}}}, {"op": "TensorArrayV3", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/TensorArray_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"element_shape": {"shape": {"dim": [{"size": "1"}, {"size": "64"}]}}, "dynamic_size": {"b": false}, "identical_element_shapes": {"b": true}, "clear_after_read": {"b": true}, "dtype": {"type": "DT_FLOAT"}, "tensor_array_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy9keW5hbWljX3Jubi9pbnB1dF8w"}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less_1/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"op": "SparseToDense", "name": "SparseToDense_1", "input": ["Squeeze_13", "Cast_1", "GatherV2_5", "SparseToDense_1/default_value"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"op": "Enter", "name": "split_16/Enter", "input": ["concat_38"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_24/Enter", "input": ["concat_38"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_17/Enter", "input": ["concat_39"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_25/Enter", "input": ["concat_39"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_20/Enter", "input": ["concat_40"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "split_28/Enter", "input": ["concat_40"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Slice", "name": "Slice_2", "input": ["Slice", "Const", "Const_5"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "GatherV2", "name": "GatherV2_6", "input": ["Slice", "Const_162", "ExpandDims_30/dim"], "attr": {"Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_3", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_3", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_4", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_4", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_3", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_3", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_4", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_4", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_3", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_3", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_4", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_4", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_3", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_3", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/NextIteration_3"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_4", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_4", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/NextIteration_4"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_2", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray:1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray_1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Const", "name": "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice_enter", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/fw/fw/Minimum_enter", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less_1/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_2", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray:1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Enter", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray_1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Const", "name": "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/bw/bw/strided_slice_enter", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/bw/bw/Minimum_enter", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less_1/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray:1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray_1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Const", "name": "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/fw/fw/strided_slice_enter", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/fw/fw/Minimum_enter", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less_1/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/TensorArrayWrite/TensorArrayWriteV3/Enter", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/TensorArray"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/TensorArray:1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"op": "Enter", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Enter", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/TensorArray_1"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV8yNGFiNzFlNS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_RESOURCE"}, "is_constant": {"b": true}}}, {"op": "Const", "name": "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/bw/bw/strided_slice_enter", "input": ["^LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/bw/bw/Minimum_enter", "input": ["^LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less_1/Enter"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_1", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_1", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_1", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_1", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_1", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/NextIteration_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/NextIteration"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"op": "AddV2", "name": "add_5", "input": ["Const_158", "SparseToDense_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"op": "Transpose", "name": "transpose", "input": ["Slice_2", "transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"op": "Slice", "name": "Slice_56", "input": ["GatherV2_6", "Const_163", "Const_164"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_2", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Enter_2", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/NextIteration_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_2", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Enter_2", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/NextIteration_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Enter_2", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/NextIteration_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Merge", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Enter_2", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/NextIteration_2"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"op": "Less", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_1", "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/fw/fw/Minimum_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge", "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/fw/fw/strided_slice_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less_1", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_1", "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/bw/bw/Minimum_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge", "ConstantFolding/LSTM_9539a08e/bidirectional_rnn/bw/bw/strided_slice_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_1", "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/fw/fw/Minimum_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge", "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/fw/fw/strided_slice_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_1", "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/bw/bw/Minimum_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Less", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge", "ConstantFolding/LSTM_24ab71e5/bidirectional_rnn/bw/bw/strided_slice_enter"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "TensorArrayScatterV3", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray_1", "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayUnstack/range", "transpose", "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "ReverseV2", "name": "LSTM_9539a08e/bidirectional_rnn/bw/ReverseV2", "input": ["transpose", "LSTM_24ab71e5/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"device": "/device:CPU:0", "op": "MatMul", "name": "MatMul", "input": ["Slice_56", "transpose_20"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"op": "LogicalAnd", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LogicalAnd", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Less_1"]}, {"op": "LogicalAnd", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LogicalAnd", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Less_1"]}, {"op": "LogicalAnd", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LogicalAnd", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Less_1"]}, {"op": "LogicalAnd", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LogicalAnd", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Less_1"]}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9mdy9mdy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "TensorArrayScatterV3", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray_1", "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayUnstack/range", "LSTM_9539a08e/bidirectional_rnn/bw/ReverseV2", "LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray_1:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "AddV2", "name": "add_6", "input": ["MatMul", "mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "LoopCond", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LogicalAnd"]}, {"op": "LoopCond", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LogicalAnd"]}, {"op": "LoopCond", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LogicalAnd"]}, {"op": "LoopCond", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LogicalAnd"]}, {"op": "Enter", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Enter_1", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArrayUnstack/TensorArrayScatter/TensorArrayScatterV3"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "TFNUTV85NTM5YTA4ZS9iaWRpcmVjdGlvbmFsX3Jubi9idy9idy93aGlsZS93aGlsZV9jb250ZXh0"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}}}, {"op": "Relu", "name": "Relu", "input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_1", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_1", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_2", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_2", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_3", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_3", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_4", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge_4", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Merge", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_1", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_1", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_2", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_2", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_3", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_3", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_4", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge_4", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Merge", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_1", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_2", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch_3", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_3", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch_4", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge_4", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Merge", "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch_1", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_1", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_2", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch_3", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_3", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch_4", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge_4", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Switch", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Merge", "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/LoopCond"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "TensorArrayReadV3", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayReadV3", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_1:1", "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/TensorArrayReadV3/Enter_1"], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"op": "Exit", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Exit_2", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Identity", "input": ["LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "TensorArrayReadV3", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayReadV3", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Enter", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_1:1", "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/TensorArrayReadV3/Enter_1"], "attr": {"dtype": {"type": "DT_FLOAT"}}}, {"op": "Exit", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Exit_2", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Identity", "input": ["LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Exit", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Exit_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Identity", "input": ["LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Exit", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Exit_2", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"op": "Identity", "name": "LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Identity", "input": ["LSTM_24ab71e5/bidirectional_rnn/bw/bw/while/Switch:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArrayStack/range", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/TensorArray", "^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Exit_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "15"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/fw/fw/while/add/y", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "concat_17", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Identity", "^split/Enter", "^split_1/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "37"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "Add", "input": ["^LSTM_9539a08e/bidirectional_rnn/fw/fw/while/Identity", "^split_4/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArrayStack/range", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/TensorArray", "^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Exit_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "15"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "LSTM_9539a08e/bidirectional_rnn/bw/bw/while/add/y", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "concat_22", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Identity", "^split_8/Enter", "^split_9/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "37"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "Add_1", "input": ["^LSTM_9539a08e/bidirectional_rnn/bw/bw/while/Identity", "^split_12/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArrayStack/range", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/TensorArray", "^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Exit_2"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "15"}]}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/add/y", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Identity"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"tensorShape": {}, "dtype": "DT_INT32"}}}}, {"op": "Const", "name": "concat_45", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Identity", "^split_16/Enter", "^split_17/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"tensorShape": {"dim": [{"size": "96"}, {"size": "128"}]}, "dtype": "DT_FLOAT"}}}}, {"op": "Const", "name": "Add_3", "input": ["^LSTM_24ab71e5/bidirectional_rnn/fw/fw/while/Identity", "^split_20/Enter"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": 